Revit 2024 API
ElectricalEquipment.IsSwitchboard Property
 The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool IsSwitchboard { get; }
Visual Basic
Public ReadOnly Property IsSwitchboard As Boolean
	Get
Visual C++
public:
property bool IsSwitchboard {
	bool get ();
}
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace